In [ ]:
with recursive number_table as(
select 1 as n
union all
select n+1 as n from number_table where n<10
) 
select n from number_table;

In [ ]:
create or replace sequence my_seq start with 1 increment by 1;

In [ ]:
ALTER SESSION SET TIMEZONE = 'Asia/Kolkata';

In [ ]:
select

current_date() as today,
year(today) as year,
month(today) as month,
quarter(today) as quarter,
day(today) as day,
week(today) as week;

In [ ]:
with recursive date_dim_cte as (
select
my_seq.nextval as row_pk,
current_date() as today,
year(today) as current_year,
month(today) as current_month,
quarter(today) as current_quarter,
day(today) as current_day,
dayofyear(today) as day_of_year,
dayofweek(today) as day_of_week,
week(today) as current_week,
dayname(today) as dayname
union all
select 
my_seq.nextval as row_pk,
dateadd('day',-1,today) as today_inc,
year(today_inc) as year,
month(today_inc) as month,
quarter(today_inc) as quarter,
day(today_inc) as day,
dayofyear(today_inc) as day_of_year,
dayofweek(today_inc) as day_of_week,
week(today_inc) as week,
dayname(today_inc) as dayname
from date_dim_cte where today_inc > '2024-10-01'
)
select * from date_dim_cte;

In [ ]:
CREATE or replace TABLE employee (
    employee_id INT PRIMARY KEY,
    employee_name VARCHAR(100),
    manager_id INT NULL -- Manager ID references another employee in the same table
);

INSERT INTO employee (employee_id, employee_name, manager_id) VALUES
(1, 'Alice', NULL),      -- Level 1: Alice is the CEO (no manager)
(2, 'Bob', 1),           -- Level 2: Bob reports to Alice
(3, 'Charlie', 1),       -- Level 2: Charlie reports to Alice
(4, 'Diana', 2),         -- Level 3: Diana reports to Bob
(5, 'Edward', 2),        -- Level 3: Edward reports to Bob
(6, 'Frank', 3),         -- Level 3: Frank reports to Charlie
(7, 'Grace', 3),         -- Level 3: Grace reports to Charlie
(8, 'Henry', 4),         -- Level 4: Henry reports to Diana
(9, 'Jack', 5),          -- Level 4: Jack reports to Edward
(10, 'Kevin', 6),        -- Level 4: Kevin reports to Frank
(11, 'Linda', 7),        -- Level 4: Linda reports to Grace
(12, 'Isabella', 8);     -- Level 5: Isabella reports to Henry

In [ ]:
select * from employee;

In [ ]:
select employee_id,employee_name,manager_id from employee where manager_id is null;

In [ ]:
select e.employee_id,e.employee_name,m.employee_name as manager_name from employee e join employee m on m.manager_id=e.employee_id  ;

In [ ]:
with recursive emp_manager_hierarchy as(

select employee_id,employee_name,manager_id,employee_name as manager_chain from employee where manager_id is null

union all

select e.employee_id,e.employee_name,e.manager_id,concat(manager_chain,'-->',e.employee_name) as manager_chain
from employee e inner join emp_manager_hierarchy emh on e.manager_id=emh.employee_id 

)
select * from emp_manager_hierarchy;

In [ ]:
select 1000 as factory,1 as count

In [ ]:
with recursive cte as(
select '10001' as factory_count,1 as count
union all 
select concat('1000',count+1) as factory_count,
count+1 as count
from cte where count <1000
)
select * from cte;